grevaillot/svd_tools/headers/STM32H742x/bdma.h
#define BDMA_CMAR1_MA_SHIFT		0
#define BDMA_CMAR1_MA_MASK		0xffffffff
/** @defgroup bdma_cmar1_ma MA Memory address Base address of the memory area from/to which the data will be read/written. When MSIZE is 01 (16-bit), the MA[0] bit is ignored. Access is automatically aligned to a half-word address. When MSIZE is 10 (32-bit), MA[1:0] are ignored. Access is automatically aligned to a word address.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma_ccr2 CCR2 DMA channel x configuration register
@{*/

/** BDMA_CCR2_MEM2MEM Memory to memory mode This bit is set and cleared by software. **/
#define BDMA_CCR2_MEM2MEM		(1 << 14)

#define BDMA_CCR2_PL_SHIFT		12
#define BDMA_CCR2_PL_MASK		0x03
/** @defgroup bdma_ccr2_pl PL Channel priority level These bits are set and cleared by software.
@{*/
/**@}*/


#define BDMA_CCR2_MSIZE_SHIFT		10
#define BDMA_CCR2_MSIZE_MASK		0x03
/** @defgroup bdma_ccr2_msize MSIZE Memory size These bits are set and cleared by software.
@{*/
/**@}*/


#define BDMA_CCR2_PSIZE_SHIFT		8
#define BDMA_CCR2_PSIZE_MASK		0x03
/** @defgroup bdma_ccr2_psize PSIZE Peripheral size These bits are set and cleared by software.
@{*/
/**@}*/

/** BDMA_CCR2_MINC Memory increment mode This bit is set and cleared by software. **/
#define BDMA_CCR2_MINC		(1 << 7)
/** BDMA_CCR2_PINC Peripheral increment mode This bit is set and cleared by software. **/
#define BDMA_CCR2_PINC		(1 << 6)
/** BDMA_CCR2_CIRC Circular mode This bit is set and cleared by software. **/
#define BDMA_CCR2_CIRC		(1 << 5)
/** BDMA_CCR2_DIR Data transfer direction This bit is set and cleared by software. **/
#define BDMA_CCR2_DIR		(1 << 4)
/** BDMA_CCR2_TEIE Transfer error interrupt enable This bit is set and cleared by software. **/
#define BDMA_CCR2_TEIE		(1 << 3)
/** BDMA_CCR2_HTIE Half transfer interrupt enable This bit is set and cleared by software. **/
#define BDMA_CCR2_HTIE		(1 << 2)
/** BDMA_CCR2_TCIE Transfer complete interrupt enable This bit is set and cleared by software. **/
#define BDMA_CCR2_TCIE		(1 << 1)
/** BDMA_CCR2_EN Channel enable This bit is set and cleared by software. **/
#define BDMA_CCR2_EN		(1 << 0)

/**@}*/

/** @defgroup bdma_cndtr2 CNDTR2 DMA channel x number of data register
@{*/


#define BDMA_CNDTR2_NDT_SHIFT		0
#define BDMA_CNDTR2_NDT_MASK		0xffff
/** @defgroup bdma_cndtr2_ndt NDT Number of data to transfer Number of data to be transferred (0 up to 65535). This register can only be written when the channel is disabled. Once the channel is enabled, this register is read-only, indicating the remaining bytes to be transmitted. This register decrements after each DMA transfer. Once the transfer is completed, this register can either stay at zero or be reloaded automatically by the value previously programmed if the channel is configured in auto-reload mode. If this register is zero, no transaction can be served whether the channel is enabled or not.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma_cpar2 CPAR2 This register must not be written when the channel is enabled.
@{*/


#define BDMA_CPAR2_PA_SHIFT		0
#define BDMA_CPAR2_PA_MASK		0xffffffff
/** @defgroup bdma_cpar2_pa PA Peripheral address Base address of the peripheral data register from/to which the data will be read/written. When PSIZE is 01 (16-bit), the PA[0] bit is ignored. Access is automatically aligned to a half-word address. When PSIZE is 10 (32-bit), PA[1:0] are ignored. Access is automatically aligned to a word address.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma_cmar2 CMAR2 This register must not be written when the channel is enabled.
@{*/


#define BDMA_CMAR2_MA_SHIFT		0
#define BDMA_CMAR2_MA_MASK		0xffffffff
/** @defgroup bdma_cmar2_ma MA Memory address Base address of the memory area from/to which the data will be read/written. When MSIZE is 01 (16-bit), the MA[0] bit is ignored. Access is automatically aligned to a half-word address. When MSIZE is 10 (32-bit), MA[1:0] are ignored. Access is automatically aligned to a word address.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma_ccr3 CCR3 DMA channel x configuration register
@{*/

/** BDMA_CCR3_MEM2MEM Memory to memory mode This bit is set and cleared by software. **/
#define BDMA_CCR3_MEM2MEM		(1 << 14)

#define BDMA_CCR3_PL_SHIFT		12
#define BDMA_CCR3_PL_MASK		0x03
/** @defgroup bdma_ccr3_pl PL Channel priority level These bits are set and cleared by software.
@{*/
/**@}*/


#define BDMA_CCR3_MSIZE_SHIFT		10
#define BDMA_CCR3_MSIZE_MASK		0x03
/** @defgroup bdma_ccr3_msize MSIZE Memory size These bits are set and cleared by software.
@{*/
/**@}*/


#define BDMA_CCR3_PSIZE_SHIFT		8
#define BDMA_CCR3_PSIZE_MASK		0x03
/** @defgroup bdma_ccr3_psize PSIZE Peripheral size These bits are set and cleared by software.
@{*/
/**@}*/

/** BDMA_CCR3_MINC Memory increment mode This bit is set and cleared by software. **/
#define BDMA_CCR3_MINC		(1 << 7)
/** BDMA_CCR3_PINC Peripheral increment mode This bit is set and cleared by software. **/
#define BDMA_CCR3_PINC		(1 << 6)
/** BDMA_CCR3_CIRC Circular mode This bit is set and cleared by software. **/
#define BDMA_CCR3_CIRC		(1 << 5)
/** BDMA_CCR3_DIR Data transfer direction This bit is set and cleared by software. **/
#define BDMA_CCR3_DIR		(1 << 4)
/** BDMA_CCR3_TEIE Transfer error interrupt enable This bit is set and cleared by software. **/
#define BDMA_CCR3_TEIE		(1 << 3)
/** BDMA_CCR3_HTIE Half transfer interrupt enable This bit is set and cleared by software. **/
#define BDMA_CCR3_HTIE		(1 << 2)
/** BDMA_CCR3_TCIE Transfer complete interrupt enable This bit is set and cleared by software. **/
#define BDMA_CCR3_TCIE		(1 << 1)
/** BDMA_CCR3_EN Channel enable This bit is set and cleared by software. **/
#define BDMA_CCR3_EN		(1 << 0)

/**@}*/

/** @defgroup bdma_cndtr3 CNDTR3 DMA channel x number of data register
@{*/


#define BDMA_CNDTR3_NDT_SHIFT		0
#define BDMA_CNDTR3_NDT_MASK		0xffff
/** @defgroup bdma_cndtr3_ndt NDT Number of data to transfer Number of data to be transferred (0 up to 65535). This register can only be written when the channel is disabled. Once the channel is enabled, this register is read-only, indicating the remaining bytes to be transmitted. This register decrements after each DMA transfer. Once the transfer is completed, this register can either stay at zero or be reloaded automatically by the value previously programmed if the channel is configured in auto-reload mode. If this register is zero, no transaction can be served whether the channel is enabled or not.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma_cpar3 CPAR3 This register must not be written when the channel is enabled.
@{*/


